---
type: TextEditorOptions
namespace: Autodesk.Revit.UI
version: 2024
members: 5
tags: [revit-api, class]
---

# TextEditorOptions

`Autodesk.Revit.UI.TextEditorOptions` · Revit 2024 · 5 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetTextEditorOptions | 2017 | `public static TextEditorOptions GetTextEditorOptions ()` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | ShowBorder | 2017 | `public bool ShowBorder { get ; set ; }` |
| Property | ShowOpaqueBackground | 2017 | `public bool ShowOpaqueBackground { get ; set ; }` |